<template lang='pug'>
.calculator
  .calculator__head
    p.calculator__text И нет сомнений, что некоторые особенности внутренней политики набирают популярность среди определенных слоев населения, а значит, должны быть преданы социально-демократической анафеме. Лишь акционеры крупнейших компаний, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут призваны к ответу. Вот вам яркий пример современных тенденций - перспективное планирование представляет собой интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности. Имеется спорная точка зрения, гласящая примерно следующее: независимые государства, вне зависимости от их уровня, должны быть заблокированы в рамках своих собственных рациональных ограничений. В своём стремлении улучшить пользовательский опыт мы упускаем, что интерактивные прототипы, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут указаны как претенденты на роль ключевых факторов. Имеется спорная точка зрения, гласящая примерно следующее: стремящиеся вытеснить традиционное производство, нанотехнологии и по сей день остаются уделом либералов, которые жаждут быть заблокированы в рамках своих собственных рациональных ограничений.
  .calculator__body
    .calculator__item(v-for="item in array" :key="item.id")
      p.calculator__title {{item.title}}
      .calculator__options(v-if="item.radios")
        .calculator__option(v-for="radio in item.radios" :key="radio.id")
          Radio(:text='radio.title' :value='radio.value' :name='radio.name')
      .calculator__options(v-if="item.options")
        Select(:data='item.options')    
</template>



<script>
export default {
  // props: ['data', 'disabled'],
  data() {
    return {
      array: [
        {
          title: 'Комплект',
          order: 1,
          radios: [
            {
              title: 'Базовый',
              name: 'Комплект',
              value: 500
            },
            {
              title: 'На пустой участок',
              name: 'Комплект',
              value: 500
            },
            {
              title: 'Расширенный',
              name: 'Комплект',
              value: 500
            },
          ]
        },
        {
          title: 'Количество этажей',
          order: 2,
          radios: [
            {
              title: 'Одноэтажный',
              name: 'Количество этажей',
              value: 1
            },
            {
              title: 'Двухэтажный',
              name: 'Количество этажей',
              value: 2
            },
          ]
        },
        {
          title: 'Количество этажей',
          order: 3,
          options: [
            {
              label: '3х3',
              value: 1
            },
            {
              label: '3х4',
              value: 2
            },
            {
              label: '3х3',
              value: 1
            },
            {
              label: '3х4',
              value: 2
            },
          ]
        },
        {
          title: 'Количество этажей',
          order: 2,
          radios: [
            {
              title: 'Одноэтажный',
              name: 'Количество этажей',
              value: 1
            },
            {
              title: 'Двухэтажный',
              name: 'Количество этажей',
              value: 2
            },
          ]
        },
        {
          title: 'Количество этажей',
          order: 3,
          options: [
            {
              label: '3х3',
              value: 1
            },
            {
              label: '3х4',
              value: 2
            },
            {
              label: '3х3',
              value: 1
            },
            {
              label: '3х4',
              value: 2
            },
          ]
        },
        {
          title: 'Количество этажей',
          order: 2,
          radios: [
            {
              title: 'Одноэтажный',
              name: 'Количество этажей',
              value: 1
            },
            {
              title: 'Двухэтажный',
              name: 'Количество этажей',
              value: 2
            },
          ]
        },
      ]
    }
  },
  methods: {
    addFilter(e) {
      this.$emit('change', this.$refs.label)
      this.$emit('input', e.target.checked)
    },
  },
}
</script>

<style lang='scss' src='./calculator.scss'></style>