<template lang="pug">
  .review
    p.review__text Мы заказали баню 3*5. Вежливый менеджер Дмитрий согласовал для нас подарок от компании, нач.производства Сергей скомплектовал и отправил качественные стройматериалы и постоянно был на связи ,бригада строителей во главе с Дмитрием отлично справилась с работой по установке бани на участке. Однозначно рекомендуем компанию СрубимБаню ! Здесь имеют опыт работы, дорожат своей репутацией и готовы вести диалог с заказчиком ,что немаловажно.
    p.review__name Марина
    p.review__location Москва
    p.review__date 10.10.2021 г. 
</template>

<script>
export default {
  props: ['data'],  
}
</script>

<style src='./review.scss' lang="scss">

</style>